Revit 2027 API
WorksetTable.GetWorkset(WorksetId) Method
 Returns the workset from a input WorksetId.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Workset GetWorkset(
	WorksetId id
)
Public Function GetWorkset (
	id As WorksetId
) As Workset
public:
Workset^ GetWorkset(
	WorksetId^ id
)
member GetWorkset :
        id : WorksetId -> Workset
Parameters
id WorksetId
 Id of a workset.
Return Value
Workset
 The returned workset. null if there is no workset in this table with this Id.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
WorksetTable Class
GetWorkset Overload
Autodesk.Revit.DB Namespace